cf/DataProcessors/ТестовыйОбработчикLLM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТестовыйОбработчикLLM</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf/Catalogs/ТестовыеРоли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТестовыеРоли</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/DataProcessors/ТестовыйОбработчикLLM/Ext/ObjectModule.bsl
// Обработчик для автотестов подсистемы LLM: этапы действия, проверка кодом и
// адаптер конфигурации. Подключается как «Обработка.ТестовыйОбработчикLLM» —
// обработка конфигурации, без реестра БСП, которого в тестовой базе нет.
//
// Поведение задается параметрами места запуска (Параметры.Дополнительные),
// чтобы один обработчик обслуживал и разрешающие, и запрещающие проверки.

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СведенияОДействияхLLM() Экспорт

	Методы = Новый ТаблицаЗначений;
	Методы.Колонки.Добавить("Метод", Новый ОписаниеТипов("Строка"));
	Методы.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Методы.Колонки.Добавить("Назначение", Новый ОписаниеТипов("Строка"));
	Методы.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	Методы.Колонки.Добавить("Параметры", Новый ОписаниеТипов("Строка"));

	ДобавитьМетод(Методы, "ПроверитьДоступность", "Проверка по флагам", "Проверка");
	ДобавитьМетод(Методы, "ПодготовитьЗапрос", "Подать файл и данные", "ПодготовкаЗапроса");
	ДобавитьМетод(Методы, "ОбработатьОтвет", "Поправить ответ", "ПослеОтвета");
	ДобавитьМетод(Методы, "ПослеДействия", "Отчитаться о действии", "ПослеДействия");
	Возврат Методы;

КонецФункции

// Проверка кодом: флаги «Скрыть» и «ЗапретитьДействие» в параметрах места.
Процедура ПроверитьДоступность(Параметры) Экспорт

	Если Параметры.ЭтапПроверки = "ВыборДействия" И Флаг(Параметры, "Скрыть") Тогда
		Параметры.Доступно = Ложь;
		Параметры.Причина = "Скрыто тестовой проверкой.";
	ИначеЕсли Параметры.ЭтапПроверки = "ПередДействием" И Флаг(Параметры, "ЗапретитьДействие") Тогда
		Параметры.Доступно = Ложь;
		Параметры.Причина = "Запрещено тестовой проверкой.";
	КонецЕсли;

КонецПроцедуры

// Подает модели свой файл и дописывает данные и запрос — как обработка,
// которая по алгоритму выбирает присоединенный файл документа.
Процедура ПодготовитьЗапрос(Параметры) Экспорт

	Если Флаг(Параметры, "ОтказатьВЗапросе") Тогда
		Параметры.Отказ = Истина;
		Параметры.Причина = "Тестовый отказ перед запросом.";
		Возврат;
	КонецЕсли;
	Параметры.Файлы.Добавить(Новый Структура("ИмяФайла,Содержимое,Представление",
		"подано обработкой.txt",
		ПолучитьДвоичныеДанныеИзСтроки("Договор № ТЕСТ-1 от 01.02.2026"),
		"Файл, поданный обработкой"));
	Параметры.ДанныеКонтекста = Параметры.ДанныеКонтекста + Символы.ПС + "Проверено обработкой.";
	Параметры.Промт = Параметры.Промт + " (режим: " + Параметры.Режим + ")";
	Параметры.Сообщения.Добавить("Обработка подала файл.");

КонецПроцедуры

// Правит ответ модели: наименование — прописными, плюс предупреждение.
Процедура ОбработатьОтвет(Параметры) Экспорт

	Если Флаг(Параметры, "ОтклонитьОтвет") Тогда
		Параметры.Отказ = Истина;
		Параметры.Причина = "Тестовый отказ после ответа.";
		Возврат;
	КонецЕсли;
	Ключ = Параметры.Ключи.Получить("Наименование");
	Если Параметры.Ответ <> Неопределено И Ключ <> Неопределено Тогда
		Значение = Параметры.Ответ.Получить(Ключ);
		Если Значение <> Неопределено Тогда
			Параметры.Ответ.Вставить(Ключ, ВРег(Значение));
		КонецЕсли;
	КонецЕсли;
	Параметры.Сообщения.Добавить("Обработка проверила ответ.");

КонецПроцедуры

Процедура ПослеДействия(Параметры) Экспорт

	Параметры.Сообщения.Добавить(СтрШаблон("После действия: применено %1, создан объект: %2.",
		Параметры.Применено, ?(ЗначениеЗаполнено(Параметры.СозданныйОбъект), "да", "нет")));

КонецПроцедуры

#КонецОбласти

#Область АдаптерКонфигурации

// Тестовые роли — справочник без наименования, как полные роли ДО: ядро
// искать их не умеет, и их берет на себя адаптер.
Функция ОбрабатываемыеТипы() Экспорт

	Типы = Новый Массив;
	Типы.Добавить("Справочник.ТестовыеРоли");
	Возврат Типы;

КонецФункции

// Пояснение выдает, дошел ли до адаптера объект поля: настоящему адаптеру он
// нужен, чтобы понять, допускает ли реквизит, например, строку.
Процедура ЗначенияДляВыбора(Параметры) Экспорт

	Пояснение = ?(ОбъектПоляПередан(Параметры), "тестовая роль", "тестовая роль, объект поля не передан");
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Роли.Роль КАК Роль,
		|	Роли.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.ТестовыеРоли КАК Роли
		|ГДЕ
		|	НЕ Роли.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Роль");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Параметры.Значения.Добавить(Новый Структура("Представление,Пояснение",
			ПредставлениеРоли(Выборка.Роль, Выборка.Подразделение), Пояснение));
	КонецЦикла;

КонецПроцедуры

// «Юрист» или «Юрист, Отдел договоров». Сочетания нет — создается, как полная
// роль в ДО: комбинация роли и подразделения появляется по требованию. Роли,
// которой нет ни в каком сочетании, адаптер не знает: такой текст — имя
// пользователя или контрагента, и искать его будет ядро.
Процедура НайтиЗначение(Параметры) Экспорт

	Части = СтрРазделить(Параметры.Текст, ",", Ложь);
	Роль = СокрЛП(Части[0]);
	Подразделение = ?(Части.Количество() > 1, СокрЛП(Части[1]), "");
	Если Не ЗначениеЗаполнено(Роль) Тогда
		Возврат;
	КонецЕсли;
	Если СтрНачинаетсяС(НРег(Роль), "неизвестн") Тогда
		Параметры.Комментарий = "Тестовый адаптер такой роли не знает.";
		Возврат;
	КонецЕсли;
	Если Не ОбъектПоляПередан(Параметры) Тогда
		Параметры.Комментарий = "Ядро не передало адаптеру объект поля.";
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Роли.Ссылка КАК Ссылка,
		|	Роли.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.ТестовыеРоли КАК Роли
		|ГДЕ
		|	Роли.Роль = &Роль
		|	И НЕ Роли.ПометкаУдаления");
	Запрос.УстановитьПараметр("Роль", Роль);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Подразделение = Подразделение Тогда
			Параметры.Значение = Выборка.Ссылка;
			Параметры.Найдено = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;

	НоваяРоль = Справочники.ТестовыеРоли.СоздатьЭлемент();
	НоваяРоль.Роль = Роль;
	НоваяРоль.Подразделение = Подразделение;
	НоваяРоль.Записать();
	Параметры.Значение = НоваяРоль.Ссылка;
	Параметры.Комментарий = "Роль заведена адаптером.";
	Параметры.Найдено = Истина;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьМетод(Методы, Метод, Представление, Назначение)

	Строка = Методы.Добавить();
	Строка.Метод = Метод;
	Строка.Представление = Представление;
	Строка.Назначение = Назначение;

КонецПроцедуры

Функция Флаг(Параметры, Имя)

	Значение = Неопределено;
	Возврат Параметры.Дополнительные.Свойство(Имя, Значение) И Значение = Истина;

КонецФункции

// Тестовые роли стоят в колонке «Исполнитель» этапов тестового маршрута.
Функция ОбъектПоляПередан(Параметры)

	Если Не ЗначениеЗаполнено(Параметры.ПолноеИмяОбъекта) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Метаданные.НайтиПоПолномуИмени(Параметры.ПолноеИмяОбъекта) = Метаданные.Справочники.ТестовыеМаршруты
		И Параметры.ТабличнаяЧасть = "Этапы"
		И Параметры.ПутьРеквизита = "Исполнитель";

КонецФункции

Функция ПредставлениеРоли(Роль, Подразделение)

	Возврат ?(ЗначениеЗаполнено(Подразделение), Роль + ", " + Подразделение, Роль);

КонецФункции

#КонецОбласти

#КонецЕсли
